START_MENU_TEXT = """Привет, {user}!
Добро пожаловать в @TopTashPlusBot

Начав использование бота Вы подтверждаете свое согласие с
<a href="https://t.me/+n2uMkFplNpQwNDY6">Пользовательским соглашением</a>
"""

# const.py
REFERENCE_MENU_TEXT = """
Реферальная система

Приглашайте друзей и получайте бонусы!

Как это работает:
1. Получите свою уникальную ссылку
2. Поделитесь ей с друзьями
3. Получайте 1 000 000 Монет за каждого приглашенного

Что получает друг:
• Уведомление о том, кто его пригласил
• Полный доступ к боту
"""

REFERENCE_LINK_TEXT = "Нажмите, чтобы получить вашу реферальную ссылку"




PROFILE_MENU_TEXT = """
*{user}:*

Монет: *{coins}*
Выиграно: *{win_coins}*
Проиграно: *{defeat_coins}*
Макс. выигрыш: *{max_win_coins}*
Макс. ставка: *{min_win_coins}*
"""

MAIN_MENU_TEXT = """
*Главное меню*

Выберите нужный раздел:
"""

